Transmitter.Tests/src/InformationRegisters/ВнешниеЗапросы/ВнешниеЗапросы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0f493aac-a55c-4297-b77f-b63ab42dc37e">
  <name>ВнешниеЗапросы</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="4773d106-7e31-4ba1-8475-b868984cedf4">
    <name>Данные</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes extendedConfigurationObject="4a606aac-354d-403b-acec-f6d099ce300a">
    <name>Сообщение</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions extendedConfigurationObject="c9166ddb-3b90-4103-a795-5b301304f6d4">
    <name>Обработчик</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>CatalogRef.ОбработчикиВнешнихЗапросов</types>
    </type>
  </dimensions>
  <dimensions extendedConfigurationObject="228bede1-2c6c-4420-9c89-db095fa86a11">
    <name>Идентификатор</name>
    <objectBelonging>Adopted</objectBelonging>
    <type>
      <types>DefinedType.ИдентификаторКоммита</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Transmitter.Tests/src/CommonModules/РС_ВнешниеЗапросы_ММ/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

	//@skip-check undefined-variable
	ЮТТесты
		.ВТранзакции()
			.ДобавитьТест("ЗаписатьДанные")
				.Перед("ОчиститьРегистр")
			.ДобавитьТест("НайтиДанные")
				.СПараметрами(ОМ_ТестовыеДанные.ПолучитьФейковыйJSON())
				.СПараметрами(123)
			.ДобавитьТест("НайтиДанныеВозвращаетНеопределеноЕслиПараметрыНеопределены")
	;
	
КонецПроцедуры

// TODO в YaxUnit не работают моки из фоновых, поэтому пока такое решение. После исправления ошибки
// можно будет убрать и добавить мок для методов Сохранить при создании объектов в фоне.
Процедура ОчиститьРегистр() Экспорт
	
	НаборЗаписей = РегистрыСведений.ВнешниеЗапросы.СоздатьНаборЗаписей();
	НаборЗаписей.Записать();
	
КонецПроцедуры

Процедура ЗаписатьДанные() Экспорт
	
	// given
	ФэйковыйОбработчик = ОМ_ТестовыеДанные.ПолучитьФейковыйОбработчик();
	
	Идентификатор = ОМ_ТестовыеДанные.ПолучитьИдентификаторКоммита();
	Данные = ОМ_ТестовыеДанные.ПолучитьФейковыйJSON();
	Сообщение = ОМ_Тесты.ЮТест().Данные().СлучайнаяСтрока();
	Дата = ОМ_Тесты.ЮТест().Данные().СлучайнаяДата();
	
	// when
	РегистрыСведений.ВнешниеЗапросы.ЗаписатьДанные(ФэйковыйОбработчик, Идентификатор, Данные, Сообщение, Дата);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧтоТаблицаБазы("РегистрСведений.ВнешниеЗапросы")
			.СодержитЗаписи();
	
	Записи = ОМ_Тесты.ЮТЗапросы().Записи("РегистрСведений.ВнешниеЗапросы", Неопределено);
	ОМ_Тесты.ЮТест().ОжидаетЧто(Записи)
		.ИмеетДлину(1)
		.Свойство("[0].Обработчик").Равно(ФэйковыйОбработчик)
		.Свойство("[0].Идентификатор").Равно(Идентификатор)
		.Свойство("[0].Данные").ИмеетТип(Тип("ХранилищеЗначения"))
		.Свойство("[0].Данные").Равно(Новый ХранилищеЗначения(Данные))
		.Свойство("[0].Сообщение").Равно(Сообщение)
		.Свойство("[0].Дата").Равно(Дата);
	
КонецПроцедуры

Процедура НайтиДанные(Знач Данные) Экспорт
	
	// given
	ФэйковыйОбработчик = ОМ_ТестовыеДанные.ПолучитьФейковыйОбработчик();
	
	Идентификатор = ОМ_ТестовыеДанные.ПолучитьИдентификаторКоммита();
	
	Запись = РегистрыСведений.ВнешниеЗапросы.СоздатьМенеджерЗаписи();
	Запись.Обработчик = ФэйковыйОбработчик;
	Запись.Идентификатор = Идентификатор;
	Запись.Данные = Новый ХранилищеЗначения(Данные);
	Запись.Записать();	
	
	// when
	Результат = РегистрыСведений.ВнешниеЗапросы.НайтиДанные(ФэйковыйОбработчик, Идентификатор);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧто(Результат)
			.Равно(Данные);	
	
КонецПроцедуры

Процедура НайтиДанныеВозвращаетНеопределеноЕслиПараметрыНеопределены() Экспорт
	
	// given
	
	// when
	Результат = РегистрыСведений.ВнешниеЗапросы.НайтиДанные(Неопределено, Неопределено);
	
	// then
	ОМ_Тесты.ЮТест()
		.ОжидаетЧто(Результат)
			.ЭтоНеопределено();	
	
КонецПроцедуры

#КонецОбласти
